packages/cf-boot/cf-boot-1.13.2.tar.gz/cf-boot-1.13.2/cfboot/scripts/service/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>service</title>
<!-- 2018-03-26 Mon 11:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ernesto Alfonso" />
</head>
<body>
<div id="content">
<h1 class="title">service</h1>
<p>
Create a service instance, and possibly extract service binding credentials.
</p>

<p>
This is a more declarative version of cf-create-service, which takes care of low-level plumbing to extract service credentials.
It is a wrapper built on top of cf-create-service, cf-delete-service, cf-push-app, extract-service-credentials.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Input</h2>
<div class="outline-text-2" id="text-1">
<p>
(required*)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">instance_name*</td>
<td class="left">string</td>
<td class="left">app-hub-redis-service</td>
<td class="left">name of the instance</td>
</tr>

<tr>
<td class="left">service*</td>
<td class="left">string</td>
<td class="left">redis</td>
<td class="left">service label</td>
</tr>

<tr>
<td class="left">plan*</td>
<td class="left">string</td>
<td class="left">shared-vm</td>
<td class="left">plan</td>
</tr>

<tr>
<td class="left">cf_home</td>
<td class="left">string</td>
<td class="left">"/tmp/cf-home-240964"</td>
<td class="left">CF_HOME where login has been issued, defaults to $HOME</td>
</tr>

<tr>
<td class="left">payload</td>
<td class="left">arbitrary</td>
<td class="left">&#xa0;</td>
<td class="left">payload to create-service</td>
</tr>

<tr>
<td class="left">credential_paths</td>
<td class="left">map (string-&gt;list of string)</td>
<td class="left">{"acs_zone": ["zone", "http-header-value"], "acs_uri": ["uri"]}</td>
<td class="left">A map {"&lt;CUSTOM_CREDENTIAL_NAME&gt;" : ["json", "path", "to", "credential"] }</td>
</tr>

<tr>
<td class="left">*if_exists</td>
<td class="left">string</td>
<td class="left">"ignore", "update", "delete"</td>
<td class="left">what to do when service instance exists</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">if_exists options</h4>
<div class="outline-text-4" id="text-1-0-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>option</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">"ignore"</td>
<td class="left">do nothing (default)</td>
</tr>

<tr>
<td class="left">"update"</td>
<td class="left">update the service instance with a new payload or service plan</td>
</tr>

<tr>
<td class="left">"delete"</td>
<td class="left">delete the old service instance, including its service bindings</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Examples:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>create an event hub instance and extract the publish and subscribe uaa scopes
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
     "instance_name": "cf-boot-service-test-ehub",
     "service": "predix-event-hub",
     "plan": "Beta",
     "payload": {"trustedIssuerIds": ["https://908485db-10b7-4bc2-acfc-740f1bc540e7.predix-uaa.run.asv-pr.ice.predix.io/oauth/token"]},
     "credential_paths": {
         "event_hub_scope_user":
         ["publish", "protocol_details", 0, "zone-token-scope", 0],

         "event_hub_scope_publish_grpc":
         ["publish", "protocol_details", 0, "zone-token-scope", 1],

         "event_hub_scope_publish_wss":
         ["publish", "protocol_details", 1, "zone-token-scope", 1],

         "event_hub_scope_subscribe_grpc":
         ["subscribe", "protocol_details", 0, "zone-token-scope", 1]
     }
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Output</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">output name</td>
<td class="left">JSON type</td>
<td class="left">example</td>
<td class="left">description</td>
</tr>

<tr>
<td class="left">"SERVICE_GUID"</td>
<td class="left">string</td>
<td class="left">"c41f5741-97f6-43a9-82dc-b32f00588819"</td>
<td class="left">guid of the instance</td>
</tr>

<tr>
<td class="left">"&lt;CREDENTIAL_NAME_A&gt;"</td>
<td class="left">any</td>
<td class="left">"predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.grpc.publish"</td>
<td class="left">custom credential value</td>
</tr>

<tr>
<td class="left">"&lt;CREDENTIAL_NAME_B&gt;"</td>
<td class="left">any</td>
<td class="left">"predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.grpc.subscribe"</td>
<td class="left">custom credential value</td>
</tr>

<tr>
<td class="left">&#x2026;</td>
<td class="left">any</td>
<td class="left">&#xa0;</td>
<td class="left">custom credential value</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Example:</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-js">{
  "event_hub_scope_subscribe_grpc": "predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.grpc.subscribe",
  "event_hub_scope_publish_grpc": "predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.grpc.publish",
  "event_hub_scope_user": "predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.user",
  "event_hub_scope_publish_wss": "predix-event-hub.zones.e7df08b1-256c-42d9-aeeb-bf94b9c92921.wss.publish",
  "SERVICE_GUID": "e7df08b1-256c-42d9-aeeb-bf94b9c92921"
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Idempotence</h2>
<div class="outline-text-2" id="text-3">
<p>
The script may be called any number of times. If the instance does not exist, it is created.
</p>
</div>
</div>
</div>
</body>
</html>
